import java.util.Scanner;


public class Main {

    private static boolean isDigit (String s) throws NumberFormatException {
        try{
            Integer.parseInt(s);
            return true;
        } catch (NumberFormatException e) {
            return false;
        }
    }


    public static void main(String[] args) {
        int I;                                  //Номер изменяемого животного
        String StrSize;                         //Строковый размер массива(для проверки)
        int size;                               //Размер массива(итог)
        String[] Zoo;                           //Строковый массив животных
        String[] Zav;                           //Строковый массив заведующих
        String ZavN;                            //Строка, ФИО заведующего
        Scanner in = new Scanner(System.in);
        while (true) {
            System.out.print("\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t" + "Production by Sergey Krasnopolsky\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t© 2019, DarkShot Ind. All rights reserved\n");
            System.out.println("\t\t\t\t\t\t\t\tУправление зоопарком \n");
            System.out.println("Введите, на сколько клеток будет рассчитан ваш зоопарк (в одной клетке - одно животное):");
            StrSize = in.next();
            if (isDigit(StrSize)) {                     //Проверка на ввод числа
                size = Integer.parseInt(StrSize);
                if (size<=0){
                    System.out.println("Ошибка, зоопарк не может быть пустым! \nДля выхода введите 1");
                    int ex111 = in.nextInt();
                    if (ex111 == 1){
                        System.exit(0);
                    }
                }
                Zoo = new String[size];         //Присвоение массиву Животных размерности
                Zav = new String[size];         //Присвоение массиву Заведующих размерности
                break;
            }
        }

        for(int i = 0; i < Zoo.length; i++){        //Заполнение всех массивом пустотой
            Zoo[i] = " ";
            Zav[i] = "—";
        }

        char y;
        do {

            while (true) {
                System.out.println("\n1. Поселить животного в клетку \n2. Назначить заведующего клеткой \n3. Поселить другое животное \n4. Заменить заведующего \n5. Продать животное \n6. Уволить заведующего \n7. Перевести заведующего в другую клетку \n8. Выйти");
                String Strc = in.next();                    //Главное меню и считывание действия
                if (isDigit(Strc)) {
                    int c = Integer.parseInt(Strc);

                    if (c == 1) {
                        while (true){
                            System.out.println("Введите номер клетки, в которую хотите поселить животное");
                            String StrIK = in.next();          //Считывание Номера клетки
                            if (isDigit(StrIK)) {
                                int IK = Integer.parseInt(StrIK);
                                IK = IK - 1;
                                if (IK > size) {
                                    System.out.println("Ошибка, клетки не существует!");

                                } else if (!Zoo[IK].equals(" ")) {
                                    System.out.println("Ошибка, в данной клетке уже присутствует животное!");

                                } else {
                                    MenuZhiv(IK, Zoo, in);
                                }
                                break;
                            }
                        }
                        break;
                    }
                    if (c == 2){
                        while (true){
                            System.out.println("Введите номер территории, для которой хотите назначить заведующего.");
                            String StrI = in.next();
                            if (isDigit(StrI)) {
                                I = Integer.parseInt(StrI);
                                I = I - 1;
                                if (I >= size) {
                                    System.out.println("Ошибка, территории с таким номером не существует!");
                                } else if (!Zav[I].equals("—")) {                                        //Если заведующий назначен...
                                    System.out.println("Ошибка, заведующий уже назначен!");
                                } else {
                                    System.out.println("Введите ФИО заведующего");
                                    ZavN = in.next();                   //Считывание ФИО заведующего
                                    Zav[I] = ZavN;
                                    System.out.println("\nЗаведующий назначен! Вы перенаправленны в главное меню");
                                }
                                break;
                            }
                            else{
                                System.out.println("Ошибка, номер территории необходимо вводить числом!");
                            }
                            break;
                        }
                    }

                    if (c == 3) {
                        while (true) {
                            System.out.println("Введите номер клетки животного, в которое хотите поселить другое животное.");
                            String StrI = in.next();                //Проверка на число
                            if (isDigit(StrI)) {
                                I = Integer.parseInt(StrI);
                                I = I - 1;
                                break;
                            }
                        }
                        if (I <= size) {
                            MenuZhiv(I, Zoo, in);
                            break;
                        }
                        else {
                            System.out.println("\nОшибка, клетки под этим номером не существует!");
                        }
                    }

                    if (c == 4) {
                        while (true) {
                            System.out.println("Введите номер клетки, за которую назначен заведующий, которого вы хотите заменить");
                            String StrI = in.next();
                            if (isDigit(StrI)) {                //Проверка на число
                                I = Integer.parseInt(StrI);
                                I = I-1;
                                break;
                            }
                        }
                        if (I <= size) {
                            System.out.println("Введите ФИО нового заведующего");
                            String ZavNew = in.next();              //Считывание ФИО заведующего
                            Zav[I] = ZavNew;
                        }

                        else{
                            System.out.println("\nОшибка, заведующего этой клеткой не существует!");
                        }
                        break;
                    }

                    if (c == 5) {
                        while (true) {
                            System.out.println("Введите номер клетки животного, которое хотите продать.");
                            String StrI = in.next();
                            if (isDigit(StrI)) {                 //Проверка на число
                                I = Integer.parseInt(StrI);
                                I = I - 1;
                                if (I < size & !Zoo[I].equals("—")) {         //Замена элимента массива на пустоту(удаление)
                                    Zoo[I] = "—";
                                    Zoo[I] = "—";
                                }
                                else {
                                    System.out.println("Ошибка, животного, которое вы хотите продать не существует!");
                                }
                                break;
                            }
                        }
                    }

                    if (c == 6){
                        while (true){
                            System.out.println("Введите номер клетки, у которой хотите уволить заведующего.");
                            String StrI = in.next();
                            if (isDigit(StrI)) {                    //Проверка на число
                                I = Integer.parseInt(StrI);
                                I = I - 1;
                                if (I < size) {      //Замена заведующего на пусто(Удаление заведующего)
                                    if (!Zav[I].equals("—")) {
                                        Zav[I] = "—";
                                        System.out.println("Вы уволили заведующего клетки, рекомендуется назначить его.");
                                    }
                                }
                                else {
                                    System.out.println("Ошибка, заведующего не существует!");
                                }
                                break;
                            }
                        }
                    }

                    if (c == 7){
                        while (true){
                            System.out.println("Введите номер клетки, за которую отвечает заведующий, которого вы хотите перевести");
                            String StrI = in.next();
                            if (isDigit(StrI)){
                                I = Integer.parseInt(StrI);
                                I = I - 1;
                                if (I > size) {
                                    System.out.println("Ошибка, заведующего не существует!");
                                } else if (Zav[I].equals("—")) {
                                    System.out.println("Ошибка, заведующего, которого вы ходите перевести не существует!");
                                } else {
                                    System.out.println("Введите номер клетки, в которую хотите перевести заведующего");
                                    String StrI1 = in.next();
                                    if (isDigit(StrI1)) {
                                        int I1 = Integer.parseInt(StrI1);
                                        I1 = I1 - 1;
                                        Zav[I1] = Zav[I];
                                        Zav[I] = "—";
                                        Zav[I] = "—";
                                        System.out.println("Заведующий переведен успешно! Вы перенаправлены в главное меню");
                                    }
                                    else {
                                        System.out.println("Ошибка, для выбора клетки введите число!");
                                    }
                                }
                            }
                            else {
                                System.out.println("Ошибка, для выбора клетки введите число!");
                            }
                            break;
                        }
                    }

                    if (c == 8) {                  //При вводе 10 - выход(Главное меню)
                        System.exit(0);
                    }
                }
            }



            System.out.println("\n1.Показать зоопарк \n2.Выйти.");
            String b = in.next();
            if (isDigit(b)) {
                if (b.equals("1")) {
                    for (int i = 0; i < Zoo.length; i++) {                      //Вывод 3 массивов на экран
                        System.out.print("\n|||||||||||||||||||||||||||||||||||||||||||||||||\n" +
                                "||||||||||||||||||||" + "Клетка №" + (i + 1) + "||||||||||||||||||||\n" +
                                "|||||||||||||||||||||||||||||||||||||||||||||||||\n" + "Заведующий: " + Zav[i] + "\n" + Zoo[i] +
                                "\n|||||||||||||||||||||||||||||||||||||||||||||||||\n");
                    }
                }
            }


            System.out.println("\nВведите 1, чтобы продолжить. \nВведите 2, для подтвержения выхода.");
            y = in.next().charAt(0);
        } while(y == '1');

    }

    private static void MenuZhiv(int i, String[] zoo, Scanner in) {
        System.out.println("Выбирите животное которое хотите поселить: \n1.Кабан \n2.Волк \n3.Лиса \n4.Слон \n5.Жираф \n6.Пума \n7.Животного нет в списке (Добавить название животного без картинки)");
        String inp = in.next();
        if (isDigit(inp)) {
            if (inp.equals("1")) {
                zoo[i] = "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⢀⢀⠀⠀⠀⢀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n" +
                        "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣤⠴⠒⣚⣉⣭⣭⣝⣓⣏⢺⢷⣤⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n" +
                        "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⡠⠤⠖⠋⠉⠀⠋⠉⠁⠀⠀⠀⠈⠉⠻⠄⢷⡄⠈⢑⣄⠀⠀⠀⠀⠀⠀⠀⠀\n" +
                        "⠀⠀⠀⠀⠀⣀⡀⢠⣶⠏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠐⠚⠳⢶⣄⠀⠀⠁⠀⢸⣦⡛⠷⣄⠀⠀⠀⠀⠀⠀\n" +
                        "⠀⣠⡤⡤⣎⡠⣻⣽⠁⠀⠀⠀⠀⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡟⠀⠀⠀⠀⠀⠛⢩⡀⣈⠑⠤⣀⠀⠀⠀\n" +
                        "⠈⠑⠺⠛⠛⠻⣿⡇⠀⠀⠀⠀⠀⠘⣷⣄⡆⠀⠀⠀⠀⠀⠀⠀⠀⢦⠀⠀⠀⠐⣟⣺⢘⣸⠀⠀⠘⠿⠒⡢\n" +
                        "⠀⠀⠀⠀⠀⠀⠸⡽⡄⠀⠰⣄⠀⣠⡿⣟⢿⢭⠦⣀⠀⠀⠀⠀⠠⣘⣷⣤⣀⣀⣀⡨⠾⠣⢽⣦⣰⡾⠋⠀\n" +
                        "⠀⠀⠀⠀⠀⠀⠀⠘⣿⡀⠀⠉⠙⢛⣉⣀⢠⣿⣿⣿⣿⡿⠂⠀⣠⡿⡿⠝⠒⠒⠚⠉⠉⠙⠲⠤⠃⠀⠀⠀\n" +
                        "⠀⠀⠀⠀⠀⠀⠀⠀⣿⠀⣀⢴⡺⠟⠚⠻⣿⠿⣟⠉⠁⢀⣴⡾⡿⠛⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n" +
                        "⠀⠀⠀⠀⠀⠀⠀⠀⠛⠛⠋⠉⠀⠀⠀⠀⠈⠉⠙⠽⠯⠚⠛⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n" +
                        "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀";
            }
            if (inp.equals("2")) {
                String q = "⠀⠀⣴⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣦⠀⠀\n" +
                        "⠀⢰⣿⣷⣈⣦⡀⠀⠰⣦⣀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣴⠆⠀⢀⣴⣃⣾⣿⡆⠀\n" +
                        "⠀⢸⣟⠛⠛⢿⣿⣶⣀⢻⣿⣷⣾⠀⡄⢠⠀⣿⣾⣿⡟⣀⣶⣿⡿⠛⠛⣻⡇⠀\n" +
                        "⠀⢸⣿⠀⠀⠀⠀⠙⠿⣿⣿⠟⣿⢠⣷⣾⡆⣿⠻⣿⣿⠿⠋⠀⠀⠀⠀⣿⡇⠀\n" +
                        "⠀⠈⣿⠀⠀⣆⢀⠀⡆⣨⢩⣧⣯⣿⡿⢿⣿⣽⣼⡍⣅⢠⠀⡀⣰⠀⠀⣿⠁⠀\n" +
                        "⠀⠀⢸⣇⢀⣿⣾⣿⣿⣳⣿⣿⡟⣿⡇⢸⣿⢻⣿⣿⣞⢿⣿⣷⣿⡀⣰⡇⠀⠀\n" +
                        "⠀⠀⠀⠹⣸⡿⣻⣷⣾⡟⠻⢿⠀⠸⡇⢸⠃⠀⡿⠟⢻⣷⣶⣟⢿⣇⠏⠀⠀⠀\n" +
                        "⠀⠀⢀⠼⢫⣾⣿⣿⣫⣽⣿⣶⣦⣆⠀⠀⣰⣤⣶⣿⣯⣜⣿⣿⣷⡝⠧⡀⠀⠀\n" +
                        "⠀⠀⠀⣰⣿⣿⣿⣿⠿⠋⠉⠙⣿⣿⠀⠀⣿⣿⠋⠉⠙⠿⣿⣿⣿⣿⣆⠀⠀⠀\n" +
                        "⠀⠀⣼⡿⣿⡿⢿⣏⠀⠻⣷⣦⠘⣿⠀⠀⣿⠇⣴⣾⠟⠀⣹⣿⢿⣿⢿⣧⠀⠀\n" +
                        "⠀⣸⠋⢰⣿⣧⡿⣽⣤⡄⠀⠙⠀⠃⠀⠀⠘⠀⠋⠀⢠⣤⣯⢿⣾⣿⡆⠙⣇⠀\n" +
                        "⠀⠁⢰⣸⣿⠃⣷⣿⣿⣿⣷⣤⠀⠀⠀⠀⠀⠀⣤⣾⣿⣿⣿⣾⠙⣿⣇⡆⠈⠀\n" +
                        "⠀⠀⣼⣿⣿⠀⢹⣿⡏⠉⣿⡏⠀⠀⠀⠀⠀⠀⢸⣿⠉⢹⣿⡏⠀⣿⣿⣧⠀⠀\n" +
                        "⠀⠀⢻⣿⣷⡇⠀⠫⠻⢸⣿⡁⠀⣤⣤⣤⣤⠀⠈⣿⡇⠟⠙⠀⢸⣾⣿⡟⠀⠀\n" +
                        "⠀⠀⢸⠃⠻⣷⣼⡀⠀⠀⢿⣇⠘⠿⢿⡿⠿⠃⣸⡿⠀⠀⢀⣧⣾⡿⠘⡇⠀⠀\n" +
                        "⠀⠀⠀⠀⠀⢻⣿⣇⠀⠀⢨⣿⣷⣌⣛⣛⣡⣾⣿⡅⠀⠀⣸⣿⡿⠁⠀⠀⠀⠀\n" +
                        "⠀⠀⠀⠀⠀⠀⢻⣿⣧⠀⠀⠉⠛⠛⠿⠿⠛⠛⠁⠀⠀⣼⣿⡿⠁⠀⠀⠀⠀⠀\n" +
                        "⠀⠀⠀⠀⠀⠀⠀⠹⢿⣆⠀⢀⠀⠀⠀⠀⠀⠀⡀⠀⣰⡿⠟⠁⠀⠀⠀⠀⠀⠀\n" +
                        "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠻⣧⣸⣿⣄⠀⠀⣠⣿⣇⣼⠟⠀⠀⠀⠀⠀⠀⠀⠀⠀\n" +
                        "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⢿⣿⡿⣧⣼⢿⣿⡿⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n" +
                        "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⢿⣿⣿⡿⠋⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀";
                zoo[i] = q;
            }
            if (inp.equals("3")) {
                String q = "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n" +
                        "⠀⠀⠀⣴⢟⣿⣶⣤⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣤⣶⢿⡻⣦⠀⠀\n" +
                        "⠀⠀⠀⣿⠏⠀⠙⣯⠻⣷⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣾⢟⡽⠋⠀⢹⣹⠀⠀\n" +
                        "⠀⠀⠀⣿⡆⠀⠀⠈⢣⣹⣌⠙⢶⣤⣄⣀⣠⣤⡶⠛⣱⡏⡞⠁⠀⠀⢸⢹⠀⠀\n" +
                        "⠀⠀⠀⢹⢳⡄⠀⠀⠀⣷⡙⢶⡄⢳⠀⠀⠀⡏⢰⡖⢫⡞⠀⠀⠀⢠⡟⡟⠀⠀\n" +
                        "⠀⠀⠀⠸⡆⠻⣤⣤⣴⡛⠫⠊⠧⠘⠀⠀⠀⠃⠜⠰⠝⢛⣦⡤⣴⠟⣸⠁⠀⠀\n" +
                        "⠀⠀⠀⠀⡿⣄⢈⡳⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠠⢞⡁⢠⣿⠀⠀⠀\n" +
                        "⠀⠀⠀⠀⠹⣝⠻⣷⢀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠠⣾⠟⣩⠇⠀⠀⠀\n" +
                        "⠀⠀⠀⠀⠀⢻⠟⠋⠉⠀⠀⠀⠀⠀⢤⣀⡤⠀⠀⠀⠀⠀⠉⠙⡻⡟⠂⠀⠀⠀\n" +
                        "⠀⠀⠀⠀⢠⡿⠃⠀⠀⡄⠀⢀⠀⠀⣸⠟⣆⠀⠀⡠⠀⢠⠀⠀⠘⢾⣄⠀⠀⠀\n" +
                        "⠀⠀⠀⣰⣏⠀⠀⠀⣈⣷⣤⢤⣽⠛⠁⣄⠈⠛⣯⡤⣤⣾⣁⠀⠀⠀⣹⣄⠀⠀\n" +
                        "⠀⠀⠀⢻⡇⠀⠀⡈⠳⠄⡘⢾⣼⣇⡼⠀⢧⣰⣯⠷⣃⠠⠟⢀⠀⠀⢿⡛⠀⠀\n" +
                        "⠀⠀⠀⠸⣖⠂⠀⠱⣄⠀⠀⠀⠈⡟⠁⠀⠈⢿⠁⠀⠀⠀⣠⠊⠀⠐⣶⠇⠀⠀\n" +
                        "⠀⠀⠀⠀⠈⠻⠦⣤⣈⡙⠦⣄⠈⠀⠀⠀⠀⠀⠀⣠⠴⢋⣁⣤⠴⠛⠁⠀⠀⠀\n" +
                        "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠓⠞⠀⠀⠀⠀⠀⠀⠰⠕⠚⠉⠀⠀⠀⠀⠀⠀⠀⠀\n" +
                        "⠀⠀⠀⠀⠀⠀⠀⠀⠀⣐⠶⠶⣇⢀⣾⣛⣷⠀⣸⠶⠶⡂⠀⠀⠀⠀⠀⠀⠀⠀\n" +
                        "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠉⠹⣤⣛⣟⣟⡤⠏⠉⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀\n" +
                        "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠙⠛⠋⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀";
                zoo[i] = q;
            }
            if (inp.equals("4")) {
                String q = "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣀⣤⡶⠖⠛⠋⠉⠛⠳⢦⣄⠀⠀⠀⠀⠀⠀⠀⠀\n" +
                        "⠀⠀⠀⢀⣠⣤⣤⣤⣴⡿⠛⠉⠁⠀⠀⠀⠀⠀⠀⠀⠠⠿⣷⣤⣀⠀⠀⠀⠀⠀\n" +
                        "⠀⣠⣶⢿⣯⣵⠶⢶⣯⣝⠦⠀⠀⠀⠀⠀⠀⠀⠀⠀⠐⠚⣁⡼⢿⣷⡀⠀⠀⠀\n" +
                        "⠛⢯⡈⠉⠁⠀⠀⠀⠈⣿⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠐⠋⣡⠴⢋⣹⣧⠀⠀⠀\n" +
                        "⠀⠀⢻⣆⠀⠀⠀⠀⠀⠛⠀⠀⠀⠀⠰⠂⣀⠀⠀⣀⣀⡀⠐⠚⣉⡴⣿⡀⠀⠀\n" +
                        "⠀⠀⠀⢻⣆⠀⠀⠀⠀⠀⣰⡶⠀⠀⠻⠎⠁⠀⠀⠈⠋⢿⡄⠉⣁⡤⢿⣧⠀⠀\n" +
                        "⠀⠀⠀⠈⢻⣦⡀⠀⠀⢰⣿⣇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠧⠀⠀⠒⢋⣿⡆⠀\n" +
                        "⠀⠀⠀⠀⠀⠙⢿⣦⠀⢸⣿⡿⣄⠀⠀⠀⠀⠀⣴⠆⠀⣀⡀⠀⠀⠈⠁⠤⢿⡄\n" +
                        "⠀⠀⠀⠀⠀⠀⠀⠙⣧⣾⠋⠛⠻⠷⠦⣤⣄⣠⡜⠃⣾⠉⠉⠉⠉⣉⡽⠐⠊⣷\n" +
                        "⠀⠀⠀⠀⠀⠀⠀⠀⠉⠁⠀⠀⠀⠀⠀⠈⠙⠿⣿⣆⢸⣿⣿⠻⣯⢻⡀⠐⠊⣹\n" +
                        "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠛⠷⠿⠃⠀⢹⣯⡆⠐⣋⣽\n" +
                        "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⢰⠀⠤⣿\n" +
                        "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣶⢿⣛⣷⠀⠀⠀⠀⠀⠀⠀⠀⣸⣟⡇⣀⣹⠇\n" +
                        "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⡿⢭⣿⡛⣲⠄⠀⠀⠀⠀⠀⠀⣰⣿⡿⠁⣴⠏⠀\n" +
                        "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢺⡯⢽⣿⣿⠉⠀⠀⠀⠀⣠⣴⣾⠟⢋⣨⡿⠋⠀⠀\n" +
                        "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⢿⣏⡙⣻⠷⠶⠶⠶⠟⢛⠉⣤⣼⣿⠟⠁⠀⠀⠀\n" +
                        "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⠷⢿⣴⣦⣤⣴⣶⣾⠿⠟⠉⠀⠀⠀⠀⠀⠀";
                zoo[i] = q;
            }
            if (inp.equals("5")) {
                String q = "⠀⠀⠀⠀⠀⠀⢀⣠⣴⣤⡀⠀⢀⣤⣶⣿⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n" +
                        "⠀⠀⠀⠀⠀⠀⣾⣿⣿⣿⡇⠀⢸⣿⣿⣿⡟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n" +
                        "⠀⠀⠀⠀⠀⠀⣿⡟⣿⡿⠁⠀⢸⣿⣿⡟⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n" +
                        "⠀⠀⠀⠀⠀⠀⢸⡇⠈⢣⡀⣀⡼⠀⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n" +
                        "⠀⠀⠀⠀⠀⠀⣸⡇⠀⠀⠉⠁⠀⠀⠈⠙⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n" +
                        "⠀⠀⠀⠀⠀⣴⠛⠁⠀⠀⠀⠀⠀⠀⠀⠀⠸⣿⣦⣀⣀⠤⠒⠉⠑⠒⣒⣦⡄⠀\n" +
                        "⠀⠀⠀⠀⣰⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⡄⠀⠀⠉⠉⠀⠀⠀⢀⣴⣿⣿⠟⠁⠀\n" +
                        "⠀⢀⣠⡎⠛⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠇⠸⠇⠀⠀⠀⢀⣴⡿⠿⠛⠁⠀⠀⠀\n" +
                        "⢮⣁⠀⣷⣦⡀⠀⠀⠀⠀⠀⠀⢀⣤⢤⡆⢰⠀⢀⣤⣴⣿⠁⠀⠀⠀⠀⠀⠀⠀\n" +
                        "⠀⠈⠛⠙⣿⢁⡄⠀⠀⠀⠀⠀⣿⣿⡾⠃⠈⣴⠀⢸⣿⣿⣷⣄⡀⠀⠀⠀⠀⠀\n" +
                        "⠀⠀⠀⠀⢸⡾⠀⠀⠀⠀⢀⣄⡀⠀⢠⣶⠂⡈⠀⣸⣿⣿⣿⣿⣿⠀⠀⠀⠀⠀\n" +
                        "⠀⠀⠀⠀⢸⠃⠀⠀⠀⠀⠘⠟⢃⣤⠈⢁⣾⠁⢀⣿⠈⠛⢋⣼⣿⣦⡀⠀⠀⠀\n" +
                        "⠀⠀⠀⢠⡏⠀⠀⠀⠀⠀⣆⠀⣾⡿⠀⢸⡟⢀⣼⣿⠀⠀⢸⣿⣿⣿⡁⠀⠀⠀\n" +
                        "⠀⠀⢀⡟⠀⠀⠀⠀⠠⡀⠉⠀⣨⣴⣄⣠⣴⣿⣿⠟⢀⡀⠈⣿⣿⣿⣿⠀⠀⠀\n" +
                        "⠀⠀⢸⠀⠀⠀⠀⣠⠀⣴⠀⣾⠿⠛⣿⡿⠟⠋⠀⣴⣿⡇⠀⣿⣿⣿⣿⡇⠀⠀\n" +
                        "⠀⠀⢸⢠⣿⠀⢰⣿⡇⠁⢠⠃⠀⠀⢹⣤⣄⠀⠀⣿⣿⣿⠀⠙⠟⢻⣿⣿⣄⠀\n" +
                        "⠀⠀⢸⠘⠋⠀⠘⠟⢁⣠⠞⠀⠀⠀⢸⣿⣿⠀⢸⣿⠟⠋⠀⠀⠀⣠⣿⣿⣿⠀\n" +
                        "⠀⠀⠸⢤⣀⣤⠶⠚⠉⠀⠀⠀⠀⠀⢸⣿⣿⠃⠀⠀⠀⠀⠀⠀⣼⣿⣿⣿⣷⠀\n" +
                        "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⡿⠁⠀⠀⠀⢀⣾⣦⠀⢻⣿⣿⣿⣿⡄\n" +
                        "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣧⣤⣤⡀⠐⣿⣿⣿⠀⠸⢿⣿⣿⣿⣇\n" +
                        "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⣿⣿⣿⡇⠀⣿⣿⣿⡄⠀⣠⣬⣿⣿⠏\n" +
                        "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣿⣿⣿⡇⠀⢸⣿⡿⠇⠀⣿⣿⡟⠁⠀\n" +
                        "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣸⣿⣿⡿⠟⠃⠀⠀⠀⠀⠀⠀⢹⣿⡇⠀⠀\n" +
                        "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠛⠛⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠉⠇⠀⠀";
                zoo[i] = q;
            }
            if (inp.equals("6")) {
                String q = "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n" +
                        "⠀⠀⠀⠀⠀⡄⠀⠀⠀⠀⠀⠸⡆⣪⡐⢄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n" +
                        "⠀⠀⠀⠀⠀⡿⢦⣀⠀⠀⠀⢀⡇⢡⢰⡀⠱⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n" +
                        "⠀⠀⠀⠀⠀⡇⠀⢀⡠⠊⠀⠘⢠⣿⡎⣷⡤⠂⠀⠈⠐⠠⣄⡀⠀⠀⠀⠀⠀⠀\n" +
                        "⠀⠀⠀⠀⠀⣠⠖⠋⠀⠀⠀⠀⠀⠈⠓⠹⠇⠀⠀⠀⠀⠀⠈⠻⣦⡀⠀⠀⠀⠀\n" +
                        "⠀⠀⠀⠀⢠⠃⠀⠀⠀⠀⠒⠒⠉⠁⠒⣦⡀⠀⠀⠀⠀⠀⠀⠀⠈⢷⡀⠀⠀⠀\n" +
                        "⠀⠀⠀⢠⠏⢠⡇⠀⠀⠀⠀⡠⠂⠀⠀⠘⣇⠀⠐⢲⡀⠀⠀⠀⠀⠈⢷⠀⠀⠀\n" +
                        "⠀⠀⢀⠏⠀⡿⠃⠀⣀⡴⠋⠀⠀⠀⠀⣸⡟⠀⠀⠀⢳⡀⠀⠀⠀⠀⢸⡆⠀⠀\n" +
                        "⠀⠀⠸⡄⠀⠃⠀⠚⡿⠋⠀⠀⠀⠐⠊⠁⠀⠀⠀⠀⠀⣷⠀⠀⠀⠀⠀⣧⠀⠀\n" +
                        "⠀⠀⠀⡷⠀⠀⠀⠈⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣸⠇⠀⠀⠀⠀⠀⣿⡆⠀\n" +
                        "⠀⠀⡰⠁⠀⠀⠀⠀⠴⠶⣆⠀⠀⠀⠀⠀⠀⠀⠀⣰⠏⠀⠀⠀⠀⠀⠀⣿⠁⠀\n" +
                        "⠀⢰⡃⠀⢀⠀⠀⠀⠀⠀⢈⡇⠀⠀⣀⣀⣀⢀⡼⠃⠀⠀⠀⠀⠀⠀⢠⡏⠀⠀\n" +
                        "⠀⠀⠳⢶⡉⠀⠀⣀⣀⠤⠞⠁⠀⠁⠀⠀⠈⠉⠀⠀⡀⠀⠀⠀⠀⠀⣸⠃⠀⠀\n" +
                        "⠀⠀⠀⠀⠀⠠⣄⣀⡠⠄⢊⠀⠀⠀⠀⠀⠀⠀⠀⠀⢱⡀⠀⠀⠀⢰⠇⠀⠀⠀\n" +
                        "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣼⠀⠀⠀⠀⠀⠀⠀⠀⠀⣸⣷⣄⠀⠀⠃⠀⠀⠀⠀\n" +
                        "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠼⠿⠦⣤⣀⠀⠀⠀⠀⢀⣼⠟⠋⠁⠀⠀⠀⠀⠀⠀⠀\n" +
                        "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⢷⣤⣴⣾⠏⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n" +
                        "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⣿⡿⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n" +
                        "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠟⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n";
                zoo[i] = q;
            }
            if (inp.equals("7")) {
                System.out.println("Введите название животного.");
                String q = in.next(); // Присвоение имени животному
                zoo[i] = "\n\t\t\t\t\t" + "'" + q + "'" + "\n";
            }
        }
        else System.out.println("\nОшибка! Для выбора пунка меню введите число");
    }

}

